#include <stdio.h>

/*
数据结构
    狭义：
        数据结构是专门研究存储的问题
        数据的存储包含两个方面： 个体的存储 + 个体关系的存储
    
    广义：
        数据结构包含数据的存储也包含数据的操作
        存储数据的操作就是算法

算法：
    狭义：
        算法适合数据的存储方式密切相关

    广义：
        算法和数据的存储方式无关
        这就是泛型的思想

数据的存储结构有几种
    线性
        连续存储（数组）
            优点：
                存储速度很快

            缺点：
                事先必须知道数组的长度
                插入删除元素很慢
                空间通常是有限制的

        离线存储（链表）
            优点：
                空间没有限制
                插入删除元素很快

            缺点：
                存取速度很慢

        线性结构的应用 --栈，队列

    非线性
        树

        图



*/